package main

import "fmt"

//九九乘法表

func main() {
	// 遍历, 决定处理第几行,会从第1行排列到第9行
	for y := 1; y <= 9; y++ {
		//遍历, 决定这一行有多少列，例如：2*2=4，一但当x=2,y=2，那么程序就会循环
		for x := 1; x <= y; x++ { //如果把 x <= y;写成 x <= 9;那么每行都会算一遍1-9
			fmt.Printf("%d*%d=%d\t", x, y, x*y) //打印相乘得数
		}
		//每行手动生成回车
		fmt.Println()
	}

	//倒着输出99乘法表
	for y := 9; y >= 1; y-- {
		// 遍历, 决定这一行有多少列，例如：2*2=4，一但当x=2,y=2，那么程序就会循环
		for x := 1; x <= y; x++ { //如果把 x <= y;写成 x <= 9;那么每行都会算一遍1-9
			fmt.Printf("%d*%d=%d\t", x, y, x*y) //打印相乘得数
		}
		// 每行手动生成回车
		fmt.Println()
	}

}
